<a href="https://colab.research.google.com/github/goutam63/hello_world/blob/main/one_hot_encoding_ipynbone.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# importing the library
import pandas as pd 
import numpy as np

In [13]:
# data loading 
data =pd.read_csv('titanic.csv',usecols=['Sex'])

In [14]:
data.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [15]:
df=pd.read_csv('titanic.csv',usecols=['Embarked'])

In [16]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [17]:
df.dropna(inplace=True)

In [18]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1